Pandas
- Pandas is a library on top of Numpy which allows Python to read in data sets from various formats, such as CSV files.
- We will mainly use pandas to read in data sets and select rows or columns of data, or quickly grab statistics, such as the mean value of column.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('salaries.csv')
df

     Name  Salary  Age Company
0   Natty   55000   39     ABC
1   Nueng  100000   44     ACC
2    Mark  250000   28     DNA
3  BamBam  200000   23    ABES

In [3]:
df[['Name', 'Salary']] # list of list of column names which we would like to see

     Name  Salary
0   Natty   55000
1   Nueng  100000
2    Mark  250000
3  BamBam  200000

In [4]:
df['Salary']

0     55000
1    100000
2    250000
3    200000
Name: Salary, dtype: int64

In [5]:
df['Salary'].mean()

151250.0

In [6]:
df['Age'] > 35 # where is the data from each column greater than 35?

0     True
1     True
2    False
3    False
Name: Age, dtype: bool

In [7]:
df[df['Age'] > 35] # get row data that age > 35

    Name  Salary  Age Company
0  Natty   55000   39     ABC
1  Nueng  100000   44     ACC

In [8]:
df['Age'].unique() # get number of the unique values

array([39, 44, 28, 23])

In [9]:
df['Age'].unique()

array([39, 44, 28, 23])

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   Salary   4 non-null      int64
 2   Age      4 non-null      int64
 3   Company  4 non-null      object
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

In [11]:
df.describe() # to see statistical summary of our data frame

              Salary        Age
count       4.000000   4.000000
mean   151250.000000  33.500000
std     89477.650841   9.678154
min     55000.000000  23.000000
25%     88750.000000  26.750000
50%    150000.000000  33.500000
75%    212500.000000  40.250000
max    250000.000000  44.000000

In [12]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
df.head()

     Name  Salary  Age Company
0   Natty   55000   39     ABC
1   Nueng  100000   44     ACC
2    Mark  250000   28     DNA
3  BamBam  200000   23    ABES

In [14]:
df.head(2)

    Name  Salary  Age Company
0  Natty   55000   39     ABC
1  Nueng  100000   44     ACC

In [15]:
df.tail(2)

     Name  Salary  Age Company
2    Mark  250000   28     DNA
3  BamBam  200000   23    ABES

In [16]:
df.dtypes

Name       object
Salary      int64
Age         int64
Company    object
dtype: object

In [17]:
df.select_dtypes(include = 'number') # select numeric data

   Salary  Age
0   55000   39
1  100000   44
2  250000   28
3  200000   23

In [18]:
df.select_dtypes(include = 'object') # select categorical data

     Name Company
0   Natty     ABC
1   Nueng     ACC
2    Mark     DNA
3  BamBam    ABES

In [19]:
df.corr()

/var/folders/0z/2gy2pkss67v3rwygb64_tfvm0000gn/T/ipykernel_48412/1134722465.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

          Salary       Age
Salary  1.000000 -0.816995
Age    -0.816995  1.000000

In [20]:
df.select_dtypes(include = 'number').corr() # check correlation between numeric data

          Salary       Age
Salary  1.000000 -0.816995
Age    -0.816995  1.000000